In [24]:
import pandas as pd

In [25]:
pd.set_option('display.max_columns' , 85)
pd.set_option('display.max_rows' ,85)

In [56]:
people={
 'first' : ["ahmed","mohamed","kamal" , "ahmed"],
    'last': ["ali", "ibrahem" , "sayd", "mahmoud"],
    'age' : [23,13,45,34]
}

In [57]:
people

{'first': ['ahmed', 'mohamed', 'kamal', 'ahmed'],
 'last': ['ali', 'ibrahem', 'sayd', 'mahmoud'],
 'age': [23, 13, 45, 34]}

In [58]:
df = pd.DataFrame(people)

In [59]:
df

     first     last  age
0    ahmed      ali   23
1  mohamed  ibrahem   13
2    kamal     sayd   45
3    ahmed  mahmoud   34

In [60]:
df.columns

Index(['first', 'last', 'age'], dtype='object')

In [61]:
df['first']

0      ahmed
1    mohamed
2      kamal
3      ahmed
Name: first, dtype: object

In [62]:
type(df['first'])

pandas.core.series.Series

In [63]:
df.set_index("age", inplace=True)

In [64]:
df

       first     last
age
23     ahmed      ali
13   mohamed  ibrahem
45     kamal     sayd
34     ahmed  mahmoud

In [65]:
df[['first','last']]

       first     last
age
23     ahmed      ali
13   mohamed  ibrahem
45     kamal     sayd
34     ahmed  mahmoud

In [66]:
df.iloc[0]

first    ahmed
last       ali
Name: 23, dtype: object

In [67]:
df.iloc[[0,1]]

       first     last
age
23     ahmed      ali
13   mohamed  ibrahem

In [68]:
df.iloc[[0,1], 1]

age
23        ali
13    ibrahem
Name: last, dtype: object

In [69]:
df.loc[23]

first    ahmed
last       ali
Name: 23, dtype: object

In [74]:
df.iloc[0:2]

       first     last
age
23     ahmed      ali
13   mohamed  ibrahem

In [75]:
df.loc[ [23,13] , ['first','last'] ]

       first     last
age
23     ahmed      ali
13   mohamed  ibrahem

In [76]:
df['first'].value_counts()

first
ahmed      2
mohamed    1
kamal      1
Name: count, dtype: int64